// PDRCore
"The emulator does not support %@ function, please use the iPhone to test"="模擬器不支持%@功能，請使用真機測試";
"%@ module is not added when packaging, please refer to %@"="打包時未添加%@模塊,請參考%@";
"Ignore"="忽略";
"Details"="查看詳情";
"%@ module is not added in manifest.json, please refer to %@"="manifest.json中未添加%@模塊，請參考%@";
"OK"="確定";
"Cancel"="取消";


"File monitoring created successfully"="文件監控創建成功";
"Monitoring file descriptor--%d"="監控文件描述符--%d";
"uploader successfully uploaded using standard protocol[%@]"="uploader 使用標準協議上傳成功[%@]";

"When show is called, the page is not downloaded, and it is buffering now...[%@]"="調用show當頁面沒有下載,現在緩衝中...[%@]";
"ValidAppkey"="未配置appkey或配置錯誤";
//pdrcore
"There is no UniMP (%@) application resource in the running path, please check whether the application resource is deployed normally"="運行路徑中無 uni小程序（%@）應用資源，請檢查應用資源是否正常部署";
"The current UniMP (%@) is not compiled in v3 mode and cannot be started normally"="當前 uni小程序（%@）非v3模式編譯，無法正常啟動";
"Repeat call"="重復調用";
"UniMP (%@) not running"="uni小程序（%@）未啟動";
"There is a running UniMP, please close it before running other UniMP"="已存在運行中的小程序，請先將其關閉在運行其他小程序";
"sendUniMPEvent Error: Parameter error"="sendUniMPEvent Error: 參數錯誤";
"sendUniMPEvent Error: UniMP does not start"="sendUniMPEvent Error: 小程序未啟動";
"The compressed picture is saved locally successfully"="压缩后的图片保存本地成功";
"Failed to download file [%@] error:%@"="下載文件失敗 [%@] error:%@";
"The network has changed ==>>>>>[%d]"="网络发生改变==>>>>>[%d]";
"No network scheduling is suspended"="沒有網絡調度暫停";
"The network resumes and continues to download-->>>>"="网络恢复继续下载-->>>>";

"Please refer to the url address"="請參考url地址";
"The current environment cannot run uni-app applications!"="當前環境無法運行uni-app應用！";
"This application is compiled with HBuilderX%@ or the corresponding cli version, while the mobile phone SDK version is %@. Mismatched versions may cause application exceptions."="本應用使用HBuilderX%@編譯或對應的cli版本編譯，而手機端SDK版本是%@。不匹配的版本可能造成應用異常。";

"Network connection failed"="网络连接失败";
"The manifest does not exist or the parsing failed"="manifest不存在或解析失敗";
"file does not exist"="文件不存在";
"PandoraApi.bundle file is missing"="缺少PandoraApi.bundle文件";

"##CoreApp##...Start restarting the app"="##CoreApp##...開始重啟應用";
"##CoreApp##...Restart the application end"="##CoreApp##...重啟應用結束";
"##CoreApp##...Enable debug mode monitoring.."="##CoreApp##...開啟debug模式監控..";
"##CoreApp##...Create a homepage..."="##CoreApp##...創建首頁..";
"The file directory has changed"="文件目錄發生變化";
"Need to refresh"="需要刷新";
"splash screen needs to be closed automatically"="splash screen 需要自動關閉";
"##--Display the wap2app startup page"="##--顯示wap2app啟動頁面";
"Start wap2app application application status appid[%@]-"="啟動wap2app應用應用狀態appid[%@]-";
"Streaming application status index[%d]--fullpage[%d]---update[%d]"="流應用狀態index[%d]--fullpage[%d]---update[%d]";
"Apply updates to reload resources"="應用更新重新加載資源";
"The app has been updated. Do you want to restart it now?"="應用已更新，是否立即重啟？";
"Reboot"="重啟";
"The page is not downloaded, the page needs to be downloaded: [%@]"="頁面未下載需要下載頁面:[%@]";
"Re-request page: [%@]"="重新請求頁面:[%@]";
"Page download is complete and start to load the page: [%@]"="頁面下載完成開始加載頁面:[%@]";
"Manifest.JSON parsing failed, please make sure the format is correct and cannot contain comments"="manifest.JSON解析失敗請確保格式正確並不能包含註釋";
"##CoreApp##...Need to restart the app"="##CoreApp##...需要重啟應用";
"##CoreApp##...Apply end successfully"="##CoreApp##...應用end成功";
"HTML5+ Runtime lacks the module configured in the upgrade package manifest.json: %@"="HTML5+ Runtime缺少升級包manifest.json中配置的模塊:%@";

"The installation package was not found in the specified location"="指定的位置未找到安裝包";
"WGT/WGTU file format error"="WGT/WGTU文件格式錯誤";
"The manifest.json file in the WGT installation package does not exist"="WGT安装包中manifest.json文件不存在";
"The manifest.json in the WGT installation package is not a valid JSON format"="WGT安装包中manifest.json不是有效的JSON格式";
"The appid of the manifest.json file in the WGT installation package does not match"="WGT安装包中manifest.json文件的appid不匹配";
"The version of the manifest.json file in the WGT installation package is higher than the existing version number"="WGT安裝包中manifest.json文件的version要高於現有版本號";
"The update.xml file in the WGTU installation package does not exist"="WGTU安装包中update.xml文件不存在";
"The update.xml in the WGTU installation package is not a valid XML format"="WGTU安装包中update.xml不是有效的XML格式";
"The appid of the update.xml file in the WGTU installation package does not match"="WGTU安装包中update.xml文件的appid不匹配";
"The version of the update.xml file in the WGTU installation package is higher than the existing version number"="WGTU安裝包中update.xml文件的version要高於現有版本號";
"Manifest.json does not exist in the www directory in the WGTU installation package"="WGTU安裝包中www目錄下manifest.json不存在";
"The format of the manifest.json file in the www directory in the WGTU installation package is incorrect"="WGTU安裝包中www目錄下manifest.json文件格式錯誤";
"The appid of the manifest.json file in the www directory in the WGTU installation package does not match"="WGTU安裝包中www目錄下manifest.json文件的appid不匹配";
"The version of the manifest.json file in the www directory in the WGTU installation package does not match"="WGTU安装包中www目录下manifest.json文件的version版本不匹配";
"Uni-app compilation mode switching does not support upgrading application resources"="uni-app編譯模式切換不支持升級應用資源";

"Appframe needs to be refreshed--%@--[%@]--"="appframe需要刷新--%@--[%@]--";
"Refresh all interfaces"="刷新所有界面";

//广告
"Unknown Error"="未知錯誤";
"UniAdError5001"="廣告位標識adpid為空，請傳入有效的adpid";
"UniAdError5002"="無效的廣告位標識adpid，請使用正確的adpid。當前廣告位為:";
"UniAdError5003"="未開通廣告，請在廣告平台申請並確保已審核通過";
"UniAdError5004"="無廣告模塊，打包時請配置要使用的廣告模塊";
"UniAdError5005"="廣告加載失敗，請稍後重試";
"UniAdError5006"="廣告未加載完成無法播放，請加載完成後再調show播放";
"UniAdError5007"="無法獲取廣告配置數據，請嘗試重試";
"UniAdError5008"="激勵視頻廣告已過期，請再次請求廣告後進行廣告展示!";
"UniAdError5009"="當前廣告正在請求中，請勿重復點擊";
"UniAdError5010"="服務器返回的配寘數據中無有效資訊";
"UniAdError5100"="其他錯誤，聚合廣告商內部錯誤";
"UniAdError5050"="當前環境沒有快手內容聯盟SDK";
"UniAdError5051"="廣告加載異常，請聯系商務解決";


//地图
"Call Baidu map"="調用百度地圖";
"No Error"="沒有錯誤";
"Invalid signature"="無效簽名";
"Illegal or expired key"="key非法或過期";
"No permission to use the corresponding interface"="沒有權限使用相應的接口";
"The number of visits exceeded the daily number of visits"="訪問已超出日訪問量";
"Users visit too frequently"="用戶訪問過於頻繁";
"Invalid user IP"="用戶IP無效";
"Invalid user domain name"="用戶域名無效";
"Security code verification error, bundleid does not correspond to key"="安全碼驗證錯誤，bundleID與key不對應";
"The request key does not match the binding platform"="請求key與綁定平臺不符";
"IP requests exceeded limit"="IP請求超限";
"The HTTPS request is not supported"="不支持HTTPS請求";
"Insufficient permission, service request rejected"="權限不足，服務請求被拒絕";
"The developer key has been deleted and cannot be used normally"="開發者key被刪除，無法正常使用";
"Request service response error"="請求服務響應錯誤";
"Abnormal data returned by engine"="引擎返回數據異常";
"Server request link timeout"="服務端請求鏈接超時";
"Read service result timeout"="讀取服務結果超時";
"The requested parameter is illegal"="請求參數非法";
"Missing required parameter"="缺少必填參數";
"The requested agreement is illegal"="請求協議非法";
"Other server unknown error"="其他服務端未知錯誤";
"Client unknown error, service return result is empty or other error"="客戶端未知錯誤，服務返回結果為空或其他錯誤";
"Protocol parsing error, usually the returned result cannot be parsed"="協議解析錯誤，通常是返回結果無法解析";
"connection timed out"="連接超時";
"URL exception"="URL異常";
"host not found"="找不到主機";
"Server connection failed"="服務器連接失敗";
"Abnormal connection, usually without network"="連接異常，通常為沒有網絡的情況";
"Connection cancelled"="連接取消";
"The format of table ID is incorrect"="table id 格式不正確";
"ID does not exist"="id 不存在";
"The server is under maintenance"="服務器維護中";
"The table ID corresponding to the key does not exist"="key對應的table id 不存在";
"No information was found for the corresponding userid"="找不到对应userID的信息";
"Key does not activate nearby-function"="key未開通“附近”功能";
"Planning points (including starting point, terminal point and passing point) are not within the scope of China"="規劃點（包括起點、終點、途經點）不在中國範圍內";
"No roads can be found near planning points (including starting point, terminal point and passing point)"="規劃點（包括起點、終點、途經點）附近搜不到道路";
"Route calculation failure is usually caused by road connectivity"="路線計算失敗，通常是由於道路連通關系導致";
"The distance between the starting point and the ending point is too long"="起點終點距離過長";
"Short string sharing authentication failed"="短串分享認證失敗";
"Short string request failed"="短串請求失敗";

"Error message:%@. Visit [%@] for more information."="錯誤信息：%@。訪問【%@】了解詳細信息。";
"Picture loading failed"="圖片加載失敗";

//livepusher
"The network is in poor condition"="網絡狀況很差";
"The network condition is normal"="網絡狀況正常";
"The network is in good condition"="網絡狀況良好";
"Background music playing error"="背景音樂播放錯誤";



//geolocation
"Unable to get location"="不能獲取到位置";
"Coordinate address resolution failed"="坐標地址解析失敗";
"Location service is not turned on"="未開啟位置服務";
"Permission verification failed"="權限驗證失敗";
"Unsupported provider"="不支持的provider";
"Unsupported coordsType"="不支持的coordsType";
"Unable to get location"="不能獲取到位置";
"The current application is running in the custom debugging base. Please do not check the custom debugging base when you package the official version."="當前應用運行在自定義調試基座中，發布正式版請打包時不要勾選自定義調試基座。";
"Appid not configured"="未配置appid";

//speech
"Turn on voice repeatedly"="重復打開語音";
"Users turn off voice"="用戶關閉語音";
"Network connection error"="網絡連接錯誤";
"Listening"="正在聆聽";

//barcode
"The specified barcode was not found"="未發現指定的條碼";

//weex devtool
"search"="搜索";

//weex
"file does not exist"="文件不存在";
"This feature is not supported"="此功能不支持";
"Invalid parameter"="無效的參數";
"IO error"="IO错误";
"Client not installed"="客戶端未安裝";
"Missing business parameter configuration"="業務參數配置缺失";
"network error"="網絡錯誤";
"User cancel"="用戶取消";
"unknown error"="未知錯誤";
"Business internal error"="業務內部錯誤";
"File creation failed"="文件創建失敗";
"The file exists"="文件存在";
"Compression failed"="壓縮失敗";
"Decompression faile"="解壓失敗";
"Writing is not allowed"="不允許寫";
"Not allowed to read"="不允許讀";
"The last call was not completed. Call again after completion"="上次調用未完成，完成後再次調用";
"No permission"="沒有權限";
"Authorization failed"="授權失敗";
"onCreateUniPlugin:method not found"="没有找到 onCreateUniPlugin: 方法";
"This class (%@) does not comply with wxmoduleprotocol!"="這個類（%@）沒有遵守WXModuleProtocol協議！";
"This class (%@) does not inherit the wxcomponent class"="這個類（%@）沒有繼承 WXComponent類";
"This class (%@) does not inherit the DCUniComponent class"="這個類（%@）沒有繼承 DCUniComponent類";

"Not 'DataUrl' data"="不是DataURL數據";
"Unsupported image data"="不支持的圖片數據";
"Image data conversion failed"="圖片數據轉化失敗";
"The specified bitmap object was not found"="未找到指定的Bitmap對象";


//push
"Offline push detected --[%@]"="檢測到離線push--[%@]";
// pay
"Payment_appleiap:Payment channel closed"="Payment_appleiap:支付通道已關閉";
"Payment_appleiap:Failed to return order information"="Payment_appleiap:返回訂單信息失敗";
"Payment_appleiap:The ID of the order does not exist"="Payment_appleiap:訂單的ID不存在";
"WeChat"="微信";
"The payment appid configured in HBuilder mainifest.json is inconsistent with the appid used to generate the order. If it is HB debugging, please package it online"="HBuilder mainifest.json中配置的支付appid和生成訂單使用的appid不壹致,如果是HB調試請在線打包";

//Oauth
"Sina Weibo"="新浪微博";
"Not logged in or logged out"="未登錄或登錄已註銷";
"Client is not installed"="未安裝客戶端";
"The client you installed does not support authorized login"="妳安裝的客戶端不支持授權登錄";

//share
"Repeated verification request"="重復的驗證請求";
"User canceled sharing"="用戶取消分享";
"User does not exist"="用戶不存在";
"User canceled sending"="用戶取消發送";
"Failed to send"="發送失敗";
"Authorization failed"="授權失敗";
"User canceled installation of Weibo client"="用戶取消安裝微博客戶端";
"Editors need to install Weibo client"="編輯需要安裝微博客戶端";
"Sending failed, user needs to install Weibo client"="發送失敗，用戶需要安裝微博客戶端";
"User clicks to cancel and return"="用戶點擊取消並返回";
"WeChat does not support"="微信不支持";
"Invalid appid or incorrect configuration"="appid無效或配置錯誤";
"WeChat is not installed"="微信未安裝";
"Thumbnail exceeds limit"="縮略圖超過限制";
"Picture exceeds limit"="圖片超過限制";
"WeChat Share"="微信分享";
"QQ is not installed"="未安裝QQ";
"app not registered"="app未註冊";
"qzone sharing does not support text type sharing"="qzone分享不支持text類型分享";
"qzone sharing does not support image type sharing"="qzone分享不支持image類型分享";
"QQ share"="QQ分享";

//zip,io,
"The left or top parameter of the clip area is wrong"="clip 區域 left 或top 參數錯誤";
"Failed to read picture information"="讀取圖片信息失敗";
"Failed to download image"="下載圖片失敗";
"File not found"="文件沒有發現";
"Not authorized"="沒有獲得授權";
"Not allowed to read"="不允許讀";
"Coding error"="編碼錯誤";
"No modification allowed"="不允許修改";
"Invalid state"="無效的狀態";
"Grammatical errors"="語法錯誤";
"Invalid edit"="無效的修改";
"Execution error"="執行出錯";
"Type does not match"="類型不匹配";
"Path exists"="路徑存在";
"Directory is not empty"="目錄不為空";

//Media
"unauthorized"="未授權";
"Unauthorized, restricted access"="未授權，訪問限制";
"Parameter error"="參數錯誤";

//Camera
"Error saving photo: %@"="保存照片出錯:%@";
"Failed to save picture: %@"="保存圖片失敗:%@";
"Error saving video: %@"="保存視頻出錯:%@";
"This video type does not currently support export"="該視頻類型暫不支持導出";
"Video export failed"="視頻導出失敗";
"Export task has been cancelled"="導出任務已被取消";
"The current device does not support this preset: %@"="當前設備不支持該預設:%@";
"The camera cannot be opened in the emulator, please use it in the real machine"="模擬器中無法打開照相機,請在真機中使用";
"Locating failed, error: %@"="定位失敗, 錯誤: %@";
"No access: PHAuthorizationStatusRestricted"="無訪問權限：PHAuthorizationStatusRestricted";
"User has authorized this application for limited photo library access"="用戶已授權此應用程序用於有限的照片庫訪問";
"Locating failed, error: %@"="重命名失敗：%@";
"Video export failed: %@,error:%@"="視頻導出失敗:%@,error:%@";

//UniMP
"The number of open UniMP has reached the upper limit"="打開的小程序數量已達到上限";
"The current environment cannot run the “VUE3” version of uni-app application!"="當前環境無法運行“VUE3”版本的uni-app應用！";
"The current environment cannot run the ”VUE2“ version of uni-app application!"="當前環境無法運行“VUE2”版本的uni-app應用！";
"UniMP resources failed to be installed"="小程序應用資源安裝失敗";
"The host is not listening for messages"="宿主未監聽消息";
